In [2]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 25
pd.options.display.max_columns = 20
pd.options.display.max_colwidth = 82
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc("figure", figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

<Token var=<ContextVar name='format_options' default={'edgeitems': 3, 'threshold': 1000, 'floatmode': 'maxprec', 'precision': 8, 'suppress': False, 'linewidth': 75, 'nanstr': 'nan', 'infstr': 'inf', 'sign': '-', 'formatter': None, 'legacy': 9223372036854775807, 'override_repr': None} at 0x000001CDB71E46D0> at 0x000001CDB6C18A00>

In [3]:
import numpy as np
import pandas as pd

In [4]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [5]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [7]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [8]:
float_data = pd.Series([1, 2, None], dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [9]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [11]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data.notna()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [14]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [78]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df

          0         1         2
0  0.702110 -0.274569 -0.139142
1  0.107657 -0.606545 -0.417064
2 -0.017007 -1.224145 -1.800840
3  1.634736  0.989008  0.457940
4  0.555154  1.306720 -0.440554
5 -0.301350  0.498791 -0.823991
6  1.320566  0.507965 -0.653438

In [79]:
df.iloc[:4, 1] = np.nan
df

          0         1         2
0  0.702110       NaN -0.139142
1  0.107657       NaN -0.417064
2 -0.017007       NaN -1.800840
3  1.634736       NaN  0.457940
4  0.555154  1.306720 -0.440554
5 -0.301350  0.498791 -0.823991
6  1.320566  0.507965 -0.653438

In [80]:
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  0.702110       NaN       NaN
1  0.107657       NaN       NaN
2 -0.017007       NaN -1.800840
3  1.634736       NaN  0.457940
4  0.555154  1.306720 -0.440554
5 -0.301350  0.498791 -0.823991
6  1.320566  0.507965 -0.653438

In [82]:
df.dropna()

          0         1         2
4  0.555154  1.306720 -0.440554
5 -0.301350  0.498791 -0.823991
6  1.320566  0.507965 -0.653438

In [83]:
df.dropna(thresh=2)

          0         1         2
2 -0.017007       NaN -1.800840
3  1.634736       NaN  0.457940
4  0.555154  1.306720 -0.440554
5 -0.301350  0.498791 -0.823991
6  1.320566  0.507965 -0.653438

In [107]:
df.dropna(axis="columns", thresh=len(df) - 2)

          0         2
0  0.702110       NaN
1  0.107657       NaN
2 -0.017007 -1.800840
3  1.634736  0.457940
4  0.555154 -0.440554
5 -0.301350 -0.823991
6  1.320566 -0.653438

In [85]:
df.dropna(subset=[1,2], thresh=2)

          0         1         2
4  0.555154  1.306720 -0.440554
5 -0.301350  0.498791 -0.823991
6  1.320566  0.507965 -0.653438

In [53]:
df.fillna(0)

          0         1         2
0  0.862580  0.000000  0.000000
1  0.670216  0.000000  0.000000
2 -0.023493  0.000000 -0.652469
3 -1.218302  0.000000  1.074623
4  0.723642  0.690002  1.001543
5 -0.503087 -0.622274 -0.921169
6 -0.726213  0.222896  0.051316

In [27]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.476985  0.500000  0.000000
1 -0.577087  0.500000  0.000000
2  0.523772  0.500000  1.343810
3 -0.713544  0.500000 -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [28]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df

          0         1         2
0 -1.541996 -0.970736 -1.307030
1  0.286350  0.377984 -0.753887
2  0.331286  1.349742  0.069877
3  0.246674 -0.011862  1.004812
4  1.327195 -0.919262 -1.549106
5  0.022185  0.758363 -0.660524

In [29]:
df.iloc[2:, 1] = np.nan
df

          0         1         2
0 -1.541996 -0.970736 -1.307030
1  0.286350  0.377984 -0.753887
2  0.331286       NaN  0.069877
3  0.246674       NaN  1.004812
4  1.327195       NaN -1.549106
5  0.022185       NaN -0.660524

In [30]:
df.iloc[4:, 2] = np.nan
df

          0         1         2
0 -1.541996 -0.970736 -1.307030
1  0.286350  0.377984 -0.753887
2  0.331286       NaN  0.069877
3  0.246674       NaN  1.004812
4  1.327195       NaN       NaN
5  0.022185       NaN       NaN

In [31]:
df.fillna(method="ffill")

C:\Users\Sam\AppData\Local\Temp\ipykernel_15624\3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0 -1.541996 -0.970736 -1.307030
1  0.286350  0.377984 -0.753887
2  0.331286  0.377984  0.069877
3  0.246674  0.377984  1.004812
4  1.327195  0.377984  1.004812
5  0.022185  0.377984  1.004812

In [133]:
df.ffill()

          0         1         2
0  0.702110       NaN       NaN
1  0.107657       NaN       NaN
2 -0.017007       NaN -1.800840
3  1.634736       NaN  0.457940
4  0.555154  1.306720 -0.440554
5 -0.301350  0.498791 -0.823991
6  1.320566  0.507965 -0.653438

In [32]:
df.fillna(method="ffill", limit=2)

C:\Users\Sam\AppData\Local\Temp\ipykernel_15624\1627181726.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill", limit=2)

          0         1         2
0 -1.541996 -0.970736 -1.307030
1  0.286350  0.377984 -0.753887
2  0.331286  0.377984  0.069877
3  0.246674  0.377984  1.004812
4  1.327195       NaN  1.004812
5  0.022185       NaN  1.004812

In [134]:
df.ffill(limit=2)

          0         1         2
0  0.702110       NaN       NaN
1  0.107657       NaN       NaN
2 -0.017007       NaN -1.800840
3  1.634736       NaN  0.457940
4  0.555154  1.306720 -0.440554
5 -0.301350  0.498791 -0.823991
6  1.320566  0.507965 -0.653438

In [33]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [34]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [35]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [36]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [38]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [39]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [40]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [108]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [110]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [111]:
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [112]:
def get_animal(x):
    return meat_to_animal[x]
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [113]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [114]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [115]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [116]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [117]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [119]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [120]:
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [121]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [122]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [123]:
data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [126]:
ages = [18, 20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32, 100, 101]

In [127]:
bins = [18, 25, 35, 60, 100]
age_categories = pd.cut(ages, bins)
age_categories

[NaN, (18.0, 25.0], (18.0, 25.0], (18.0, 25.0], (25.0, 35.0], ..., (35.0, 60.0], (35.0, 60.0], (25.0, 35.0], (60.0, 100.0], NaN]
Length: 15
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [128]:
age_categories.codes

array([-1,  0,  0,  0,  1,  0,  0,  2,  1,  3,  2,  2,  1,  3, -1],
      dtype=int8)

In [129]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [130]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [131]:
pd.value_counts(age_categories)

C:\Users\Sam\AppData\Local\Temp\ipykernel_15624\3010498523.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    2
Name: count, dtype: int64

In [132]:
age_categories.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    2
Name: count, dtype: int64

In [135]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [18, 25), [25, 35), [25, 35), ..., [35.0, 60.0), [35.0, 60.0), [25.0, 35.0), NaN, NaN]
Length: 15
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [136]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)

[NaN, 'Youth', 'Youth', 'Youth', 'YoungAdult', ..., 'MiddleAged', 'MiddleAged', 'YoungAdult', 'Senior', NaN]
Length: 15
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [138]:
data = np.random.uniform(size=20)
data

array([0.5547, 0.4512, 0.7253, 0.3785, 0.8407, 0.4693, 0.5626, 0.6612,
       0.4622, 0.6236, 0.2219, 0.7329, 0.3817, 0.1948, 0.2712, 0.2492,
       0.1521, 0.7714, 0.2554, 0.1275])

In [144]:
pd.cut(data, 4, precision=2)

(-2.96, -1.23]     95
(-1.23, 0.49]     608
(0.49, 2.21]      286
(2.21, 3.93]       11
Name: count, dtype: int64

In [145]:
pd.cut(data, 4, precision=2).value_counts()

(-2.96, -1.23]     95
(-1.23, 0.49]     608
(0.49, 2.21]      286
(2.21, 3.93]       11
Name: count, dtype: int64

In [140]:
data = np.random.standard_normal(1000)
data

array([-0.9266,  1.7551,  1.2098,  1.27  , -0.9744, -0.6347, -0.3957,
       -0.2894, -0.7343, -0.7285,  0.8388,  0.2669,  0.7212,  0.911 ,
       -1.0209, -1.4134,  1.2966,  0.2523,  1.1275, -0.5684,  0.3094,
       -0.5774, -1.1686, -0.825 , -2.6444, -0.153 , -0.7519, -0.1326,
        1.4573,  0.6095, -0.4938,  1.24  , -0.1357,  1.43  , -0.8469,
        0.6033,  1.2636, -0.2555, -0.4457,  0.4684, -0.9616, -1.8245,
        0.6254,  1.0229,  1.1074,  0.0909, -0.3501,  0.218 , -0.8948,
       -1.7415, -1.0523,  1.4366, -0.5762, -2.4203, -1.0623,  0.2374,
        0.001 ,  0.0653, -1.3675, -0.0303,  0.9405, -0.6424,  1.0402,
       -1.0829,  0.4292, -0.2362,  0.6418, -0.3317,  1.3941, -1.0767,
       -0.1925, -0.8712,  0.4209, -1.2114, -0.2589, -0.5816, -1.2604,
        0.4646, -1.0702,  0.8042, -0.1567,  2.0104, -0.8871, -0.9779,
       -0.2672,  0.4833, -0.4003,  0.4499,  0.3996, -0.1516, -2.5579,
        0.1608,  0.0765, -0.2972, -1.2943, -0.8852, -0.1875, -0.4936,
       -0.1154, -0.3507,  0.0447, -0.8978,  0.8909, -1.1512, -2.6123,
        1.1413, -0.8671,  0.3836, -0.437 ,  0.3475, -1.2302,  0.5711,
        0.0601, -0.2255,  1.3497,  1.3503, -0.3867,  0.866 ,  1.7472,
       -1.4102, -0.3782, -0.3458,  0.3801,  0.189 ,  1.3233, -2.2646,
       -0.915 , -0.479 ,  1.0472,  0.9239, -0.1142,  0.4058,  0.2885,
       -0.4348,  0.3588, -0.3882,  2.1287,  1.4096, -0.1054,  0.7004,
        2.0929, -0.137 , -0.9305,  0.3275,  1.303 , -1.4094, -0.1441,
       -0.7164,  0.1036, -1.4957, -1.1749,  2.614 , -0.6893, -0.7517,
        0.6363, -1.1576,  0.6147,  1.0214,  0.6683, -0.8095, -0.9081,
        1.5123,  0.0951,  1.1847,  0.637 , -0.5393, -0.0551, -1.1359,
       -0.1705, -1.1581,  1.1046,  0.6342,  1.2597,  0.9649, -0.4344,
       -0.8796, -0.6948,  1.2264,  0.4573,  0.1157,  1.014 , -1.135 ,
       -0.2634,  1.3064, -1.6108, -1.0266,  1.2416, -0.1568, -2.4491,
       -1.0339,  1.5995,  0.4741,  0.1513, -0.5422, -0.4755,  0.1064,
       -1.3082,  2.1732,  0.5646, -0.1905, -0.9169, -0.9758,  2.2123,
        0.0739,  1.8186, -1.5815, -0.7744,  0.5529,  0.1061,  3.9275,
       -0.2551,  0.8541, -0.3648,  0.1311, -0.6976,  1.3356, -0.151 ,
        0.4429,  0.9416,  0.5334,  0.3563, -0.0101,  1.4158,  0.5661,
        0.4565,  0.1948, -0.6551, -0.5652,  3.1769,  0.9595, -0.9753,
       -1.1167, -1.1044, -0.8988, -1.3666,  0.4514, -1.5872, -0.7328,
       -0.5146, -0.6119, -0.0316,  0.2341,  0.2719,  1.2308,  1.2883,
        0.8518, -1.5292, -1.5517,  0.2973,  0.3448, -0.3981,  0.4294,
       -0.2859, -2.2284,  0.0666,  0.49  ,  1.8679,  2.0704, -0.2454,
        0.7623,  0.129 ,  0.6271, -1.0622, -1.4995,  0.5452,  0.4008,
       -1.9462,  0.505 , -0.9105, -0.2197,  0.4081, -0.6031, -0.3611,
        0.564 , -1.0566,  1.392 , -1.7613, -0.9116,  0.6583, -1.5795,
        0.4577, -0.1833, -0.6855,  0.1064, -0.3182,  0.4337,  0.5718,
        0.5671,  0.0816, -0.3023, -0.7269,  0.1803, -0.5202,  0.3981,
       -0.9169, -0.0827, -1.9397,  1.408 ,  1.5124,  0.5265, -0.2669,
        0.8623,  0.0838, -1.8723, -0.9628,  0.0801,  0.1287, -0.4791,
       -0.6403,  0.746 , -0.6225,  0.9363,  0.75  , -0.0567,  2.3007,
        0.5695,  1.4894,  1.2643, -0.7618, -0.3316, -1.7513,  0.6289,
        0.2825, -1.3381, -0.5006,  0.1216,  1.7083, -0.971 , -0.6193,
       -0.7267,  1.2217,  0.5037, -1.3879,  0.2049,  0.6037,  0.5457,
        0.2355,  0.1118, -1.2515, -2.9493,  0.6346,  0.1242,  1.2976,
       -1.6869,  1.0895,  2.0609, -0.2412, -0.9479,  0.6763, -0.6534,
       -0.6523,  0.5288,  0.3578,  0.1886,  0.8694, -0.0507, -0.7164,
       -0.1033, -1.141 , -0.5008, -0.3893, -0.4739,  0.1287,  0.1537,
        0.4448,  0.1285,  0.2525, -0.9406,  1.0021, -0.5254, -0.8874,
        1.8313, -0.923 ,  0.7005, -0.8922,  2.3007, -0.8178,  0.5138,
        0.6236,  1.4892,  1.9405,  0.5432,  0.5062,  1.662 , -1.1892,
        0.0936, -0.5392, -1.4374,  0.1879, -0.4505, -0.5169, -0.0956,
        0.3164,  0.6033, -1.4946, -0.1109,  0.2413, -0.5826, -0.2411,
        0.2364,  0.1247,  1.0463, -0.2731, -0.5348, -0.3066, -0.1622,
       -1.0832,  0.7084,  1.5207,  0.2903, -0.6831, -0.9503,  0.4007,
       -0.1261,  0.3982,  0.1416, -0.2641, -0.4522,  0.7582, -0.5156,
       -0.5912,  0.8967, -0.9714,  1.8408,  0.1539, -0.2741, -1.7849,
        0.981 , -0.8737, -1.0156, -0.4112,  1.4656, -1.0062, -0.9021,
        0.7528, -0.4905, -0.5247, -0.6992,  0.3524,  0.0681, -0.9303,
        0.8454,  0.0165,  0.845 ,  1.8508,  0.0221, -1.3692,  0.8872,
        0.0143, -0.0742, -0.0486,  1.235 , -0.4333,  1.391 ,  0.8202,
       -0.2474,  0.3023,  0.544 , -0.9424, -1.2664,  0.9372, -0.7201,
       -1.594 , -0.3755, -0.9587,  0.7943, -1.6051,  0.5437,  0.9252,
       -1.4696, -0.3996,  1.4173, -0.8976,  1.8448,  1.2532, -1.4909,
       -0.0277,  1.3752, -0.0252, -0.6679, -2.868 ,  0.2107,  1.2872,
       -0.5743,  0.4953,  0.396 ,  0.5888, -1.2818,  2.0299, -0.5019,
       -0.1593, -1.4962,  0.0114,  0.4194,  2.0512, -0.3688, -1.6893,
        0.1477, -0.181 ,  0.1581, -0.3966, -0.4002, -0.8249, -0.2444,
        1.2195, -0.4336,  0.8612, -0.3345,  0.1596, -0.9842,  0.7541,
       -0.2844,  0.3248, -0.8854, -1.2809,  0.1961,  0.9546, -0.801 ,
        0.0159,  1.0876, -0.6312, -0.0227,  0.6859,  0.5192,  0.1827,
        0.2046, -0.266 , -0.0002,  1.2395, -0.8197, -0.2604,  0.5191,
        0.1431, -0.1167,  1.4967, -1.4843, -1.6712,  0.9172, -0.758 ,
        2.0648, -0.8508,  0.4995, -0.0793, -1.4033,  1.5789,  0.0004,
        0.9009, -0.4549, -0.8645,  1.1291,  0.0579, -0.4337,  0.0927,
       -1.3978,  1.4578, -0.1768, -0.2542, -1.2634,  0.4523, -0.8401,
       -0.5027,  0.5134,  1.6417,  0.5808, -1.7073, -0.1784, -0.8285,
        1.2863, -0.4065,  0.1566,  0.0521,  0.9558,  0.7432, -0.4863,
        1.9205, -0.6527, -0.1733, -0.3604, -0.3804, -1.2981,  0.5279,
       -0.0931,  0.4012, -0.1026,  0.0309,  2.6161, -0.7856, -0.507 ,
       -2.0182, -0.6769,  2.6667,  1.4515,  0.6346, -0.5028,  0.5129,
        1.7568, -0.9743,  0.6804,  0.9558,  1.5015, -0.7563,  0.4735,
        1.7137, -1.1477,  0.0029, -1.1006, -0.2975,  0.5024, -0.001 ,
       -0.6746,  0.298 ,  1.4656, -0.3036, -0.9945,  0.1899, -1.684 ,
       -0.4584,  0.5434, -1.1873, -0.4126,  1.1771, -0.3137,  1.579 ,
        0.3754, -1.5681, -0.9009,  0.6523,  0.8716,  0.2682,  0.9477,
        0.1473, -1.7725,  0.5924,  0.0903,  0.6511, -0.0812,  0.8019,
        0.1398, -0.501 , -0.1283,  0.4146,  0.6046,  2.1341,  0.9412,
       -0.9315, -0.1247,  0.2007,  0.1803, -0.3204, -1.5961, -1.2817,
        1.5026,  0.6535, -0.3195,  0.9551,  0.262 ,  0.1608, -0.5717,
        0.3517,  1.115 ,  1.1833,  1.0609,  0.5107, -0.9388, -0.5465,
        0.59  ,  1.4822,  0.1021,  0.2654,  0.0032, -2.595 , -1.5556,
        1.103 ,  0.5547, -1.289 ,  0.3852, -1.7173, -1.0184,  0.0516,
        0.5033, -0.5432, -0.5067,  0.7297,  0.4343, -1.1337,  1.424 ,
        0.2664, -0.8543, -0.5506, -0.6191,  1.0389, -0.9106,  0.53  ,
       -0.0085, -1.129 ,  0.5699, -0.8634, -1.3561, -0.0572, -0.1086,
        1.6524, -1.3509, -0.5461,  0.9914,  2.201 ,  0.4279,  0.2905,
        0.612 , -0.5125, -0.7242,  1.6929, -0.2993,  1.5717,  0.4614,
       -0.6738, -1.141 , -1.2289, -1.1593, -0.3208,  1.0883, -0.9062,
       -0.4642, -0.5134,  1.6178, -0.8167,  0.2447, -1.3111,  0.3884,
        1.5924,  0.8704,  0.3352,  0.649 , -0.1832,  0.5002,  1.3688,
        0.8951,  0.6473, -0.5679, -0.5795, -0.7514,  1.0755, -0.6211,
        1.8786,  1.2602,  0.3101,  0.1064,  0.248 , -1.3938, -0.6694,
       -0.5668, -0.3818, -0.9465, -1.0651, -1.3318, -0.9865, -0.3784,
        0.7647,  0.0604,  0.6185, -0.4849, -0.2805,  0.407 ,  1.0252,
        0.2548,  0.0875,  0.0707, -0.5732,  1.2289, -0.9622,  1.5256,
        0.8273,  0.9125, -0.1273,  0.6343, -1.5309, -1.2907, -0.5262,
       -1.1322, -0.4998, -0.7285, -0.5831,  0.3293, -0.8269, -0.5369,
       -0.563 ,  0.9184, -0.0794, -0.2786, -0.1305, -1.397 , -0.2447,
        0.8303,  0.2408, -0.9157, -2.2253, -0.6631, -0.3212,  0.4984,
        0.3803, -1.067 ,  0.2555,  2.1113, -0.6342,  1.3688, -0.9706,
        0.6542, -1.1719, -0.0032, -0.7456,  1.5983, -0.9134,  2.4029,
       -0.5894,  0.1077, -0.1393, -1.1599,  0.619 ,  1.3739, -0.9835,
        0.9309, -0.8117, -1.8302, -0.1387,  0.3341,  0.4887, -0.1781,
        2.1223,  0.0612,  0.8841, -0.6085, -0.0721,  0.5441,  0.3239,
       -1.6833,  0.5269,  1.8588, -0.5484, -0.2794, -0.0213, -0.288 ,
        0.0892,  0.5229,  0.5728, -1.7604,  1.1282,  1.5686, -0.3423,
       -0.0098,  0.0531, -0.0419, -1.6943, -0.3624,  1.1275,  2.1838,
       -1.1866,  0.3343, -1.0284, -0.1685, -0.9989, -1.5312, -1.0791,
       -1.0977,  0.4051, -0.2272, -1.4428, -1.4226, -1.1232,  0.2162,
       -0.4598,  0.3334, -0.2547, -0.4483, -1.2613,  1.1651, -0.6212,
       -0.7993,  0.7772, -0.6129,  0.3164,  0.8383, -1.0344,  0.4343,
       -2.2131,  0.758 ,  0.5539,  0.3392, -0.6888, -0.8155, -0.3324,
        2.4065, -1.3614, -0.6696,  0.7812, -0.3958, -0.1807,  1.3375,
       -0.4166,  0.3293, -0.7326,  0.1379, -0.7197,  1.9276, -0.3158,
       -1.8693, -0.4286, -0.0179, -1.7203,  0.0109,  0.8242, -0.4892,
        1.8325,  1.6587,  0.4541, -0.195 , -0.9769, -0.2961, -0.5813,
       -0.0199, -0.0381,  1.1926, -1.0981, -0.6329,  0.8024, -0.0651,
       -0.1542,  0.9219,  1.9565,  0.3797,  0.2708, -1.1271,  0.526 ,
        0.5903,  1.1391,  0.0549,  0.5501,  0.1604,  0.1603, -0.7129,
       -0.3083,  0.3176,  2.4588, -0.8788,  0.8507,  0.2059,  0.303 ,
       -0.226 ,  1.9055,  1.4967,  0.134 , -0.5037, -0.611 ,  0.046 ,
        1.0062,  0.9306, -0.1703, -0.5956, -0.4638, -1.2542, -1.0777,
       -0.6085,  0.11  , -0.0765, -0.469 ,  0.2668, -1.8483, -1.0802,
        0.0029, -0.6301, -1.0957,  0.5798,  0.3322, -1.2727, -0.6733,
       -0.511 , -1.4893,  0.6677, -1.8229,  0.8412,  0.3983, -0.9978,
        0.8727, -0.5599,  0.3308, -1.0184, -0.3428, -0.3207, -0.4087,
       -2.4316,  0.5338, -0.5062, -0.4676, -0.8043, -1.6237, -0.1057,
       -0.5462,  2.0131, -0.5437, -0.6541, -0.4964, -0.0764])

In [141]:
quartiles = pd.qcut(data, 4, precision=2)
quartiles

[(-2.96, -0.68], (0.58, 3.93], (0.58, 3.93], (0.58, 3.93], (-2.96, -0.68], ..., (0.58, 3.93], (-0.68, -0.053], (-0.68, -0.053], (-0.68, -0.053], (-0.68, -0.053]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.96, -0.68] < (-0.68, -0.053] < (-0.053, 0.58] < (0.58, 3.93]]

In [142]:
pd.value_counts(quartiles)

C:\Users\Sam\AppData\Local\Temp\ipykernel_15624\3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-2.96, -0.68]     250
(-0.68, -0.053]    250
(-0.053, 0.58]     250
(0.58, 3.93]       250
Name: count, dtype: int64

In [146]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-2.9499999999999997, -1.176]    100
(-1.176, -0.0529]                400
(-0.0529, 1.272]                 400
(1.272, 3.928]                   100
Name: count, dtype: int64

In [206]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data

            0         1         2         3
0   -2.308016  1.483880  0.411513  0.121961
1    0.503309 -1.342273  0.114388  0.284391
2   -0.367993  1.200629 -0.889908  0.799910
3   -0.852529 -1.361494  0.857390  0.952926
4   -0.251482  1.882210 -0.140391  0.247368
..        ...       ...       ...       ...
995  0.756936  0.725211 -0.478030  0.391696
996 -1.787377  0.083828 -2.286217 -0.759899
997  0.948486 -0.887921 -1.211448 -1.705220
998 -0.592075 -1.165542 -0.217629  0.396850
999  0.374116 -0.079060 -4.279976 -0.170774

[1000 rows x 4 columns]

In [207]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.033350     0.010619     0.006365     0.016348
std       0.991562     1.003274     0.993838     1.010657
min      -4.082307    -2.969681    -4.279976    -3.304966
25%      -0.696320    -0.650682    -0.646056    -0.661942
50%      -0.048783     0.013431     0.018075     0.052833
75%       0.649775     0.662491     0.705220     0.688937
max       3.247475     3.172140     3.073213     3.360897

In [208]:
col = data[2]
col[col.abs() > 3]

69     3.023134
622    3.073213
799    3.036644
999   -4.279976
Name: 2, dtype: float64

In [209]:
col.abs() > 3

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999     True
Name: 2, Length: 1000, dtype: bool

In [210]:
data.abs() > 3

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False   True  False

[1000 rows x 4 columns]

In [211]:
(data.abs() > 3).any()

0    True
1    True
2    True
3    True
dtype: bool

In [212]:
(data.abs() > 3).any(axis="columns")

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999     True
Length: 1000, dtype: bool

In [218]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
69   1.534879  0.659497  3.023134  1.585389
206  3.224034 -1.113995  0.493246  0.203898
426 -1.223462 -0.951295 -0.732177  3.360897
591 -4.082307  0.115472  0.427019 -0.522019
622  0.539954  1.558275  3.073213  1.048968
736  3.247475  1.792567  0.710713  0.701520
794  3.045954 -1.141131  0.262557 -1.035763
799 -0.954686 -0.210710  3.036644  1.842372
838 -0.531412  3.172140  0.143175  1.402991
989 -0.516695  3.038956  0.689113 -3.304966
999  0.374116 -0.079060 -4.279976 -0.170774

In [221]:
(data.abs() > 3).sum(axis="columns")

0      0
1      0
2      0
3      0
4      0
      ..
995    0
996    0
997    0
998    0
999    1
Length: 1000, dtype: int64

In [219]:
data[(data.abs() > 3).sum(axis="columns") >= 2]

            0         1         2         3
989 -0.516695  3.038956  0.689113 -3.304966

In [195]:
np.sign(data) * 3

       0    1    2    3
0    3.0  3.0 -3.0 -3.0
1   -3.0  3.0  3.0 -3.0
2   -3.0 -3.0 -3.0  3.0
3    3.0  3.0  3.0 -3.0
4   -3.0 -3.0  3.0  3.0
..   ...  ...  ...  ...
995  3.0 -3.0  3.0 -3.0
996  3.0  3.0  3.0 -3.0
997 -3.0  3.0  3.0 -3.0
998  3.0  3.0 -3.0  3.0
999 -3.0  3.0  3.0  3.0

[1000 rows x 4 columns]

In [196]:
data[data.abs() > 3] = np.sign(data) * 3
data.iloc[[75,100,230,277]]

            0         1         2         3
75  -1.489120  0.789160  1.051142  0.056664
100 -0.749019  1.609770 -1.030766  0.200569
230 -0.899906  0.075934 -0.388271  0.775279
277 -2.072744  0.721187 -0.732766  0.218914

In [197]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.000713    -0.006675    -0.029440    -0.012171
std       0.991567     0.991494     0.964510     1.016812
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.707701    -0.660234    -0.694552    -0.692167
50%       0.035344     0.016752     0.024996     0.018991
75%       0.678529     0.649798     0.613988     0.671935
max       3.000000     3.000000     3.000000     3.000000

In [198]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1 -1.0  1.0  1.0 -1.0
2 -1.0 -1.0 -1.0  1.0
3  1.0  1.0  1.0 -1.0
4 -1.0 -1.0  1.0  1.0

In [199]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [200]:
sampler = np.random.permutation(5)
sampler

array([1, 2, 3, 0, 4], dtype=int32)

In [201]:
df.take(sampler)

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6
4  28  29  30  31  32  33  34

In [202]:
df.iloc[sampler]

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6
4  28  29  30  31  32  33  34

In [222]:
column_sampler = np.random.permutation(7)
column_sampler

array([1, 4, 3, 6, 0, 5, 2], dtype=int32)

In [223]:
df.take(column_sampler, axis="columns")

    1   4   3   6   0   5   2
0   1   4   3   6   0   5   2
1   8  11  10  13   7  12   9
2  15  18  17  20  14  19  16
3  22  25  24  27  21  26  23
4  29  32  31  34  28  33  30

In [224]:
df.iloc[:, column_sampler]

    1   4   3   6   0   5   2
0   1   4   3   6   0   5   2
1   8  11  10  13   7  12   9
2  15  18  17  20  14  19  16
3  22  25  24  27  21  26  23
4  29  32  31  34  28  33  30

In [226]:
df.sample(n=3)

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27

In [227]:
df.sample(n=3, axis="columns")

    4   0   1
0   4   0   1
1  11   7   8
2  18  14  15
3  25  21  22
4  32  28  29

In [229]:
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [230]:
choices.sample(n=10, replace=True)

1    7
4    4
4    4
0    5
3    6
4    4
4    4
2   -1
0    5
2   -1
dtype: int64

In [232]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [233]:
pd.get_dummies(df["key"], dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [234]:
dummies = pd.get_dummies(df["key"], prefix="key", dtype=float)
dummies

   key_a  key_b  key_c
0    0.0    1.0    0.0
1    0.0    1.0    0.0
2    1.0    0.0    0.0
3    0.0    0.0    1.0
4    1.0    0.0    0.0
5    0.0    1.0    0.0

In [235]:
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [240]:
mnames = ["movie_id", "title", "genres"]
movies = pd.read_table("datasets/movielens/movies.dat", sep="::",
                       header=None, names=mnames, engine="python")
movies

,movie_id,title,genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [241]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [253]:
movies["genres"].str

In [242]:
dummies = movies["genres"].str.get_dummies("|")
dummies

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0
2,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
3879,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3880,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3881,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3882,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0

In [243]:
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [247]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))
movies_windic

,movie_id,title,genres,Genre_Action,Genre_Adventure,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Crime,Genre_Documentary,...,Genre_Fantasy,Genre_Film-Noir,Genre_Horror,Genre_Musical,Genre_Mystery,Genre_Romance,Genre_Sci-Fi,Genre_Thriller,Genre_War,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,0,0,1,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0,1,0,1,0,0,0,...,1,0,0,0,0,0,0,0,0,0
2,3,Grumpier Old Men (1995),Comedy|Romance,0,0,0,0,1,0,0,...,0,0,0,0,0,1,0,0,0,0
3,4,Waiting to Exhale (1995),Comedy|Drama,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Father of the Bride Part II (1995),Comedy,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
3879,3949,Requiem for a Dream (2000),Drama,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3880,3950,Tigerland (2000),Drama,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3881,3951,Two Family House (2000),Drama,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3882,3952,"Contender, The (2000)",Drama|Thriller,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [248]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [249]:
np.random.seed(12345) # to make the example repeatable
values = np.random.uniform(size=10)
values

array([0.9296, 0.3164, 0.1839, 0.2046, 0.5677, 0.5955, 0.9645, 0.6532,
       0.7489, 0.6536])

In [250]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

In [255]:
pd.cut(values, bins)

[(0.8, 1.0], (0.2, 0.4], (0.0, 0.2], (0.2, 0.4], (0.4, 0.6], (0.4, 0.6], (0.8, 1.0], (0.6, 0.8], (0.6, 0.8], (0.6, 0.8]]
Categories (5, interval[float64, right]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [292]:
s = pd.Series([1, 2, 3, None])
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [293]:
s.dtype

dtype('float64')

In [294]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [295]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [296]:
s.dtype

Int64Dtype()

In [297]:
s[3]

In [298]:
s[3] is pd.NA

True

In [299]:
s = pd.Series([1, 2, 3, None], dtype="Int64")
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [300]:
s.dtypes

Int64Dtype()

In [301]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [302]:
s.dtypes

string[python]

In [303]:
df = pd.DataFrame({"A": [1, 2, None, 4],
                   "B": ["one", "two", "three", None],
                   "C": [False, None, False, True]})
df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [304]:
df["A"] = df["A"].astype("Int64")
df["B"] = df["B"].astype("string")
df["C"] = df["C"].astype("boolean")
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

In [305]:
df.dtypes

A             Int64
B    string[python]
C           boolean
dtype: object

In [306]:
val = "a,b,  guido"
val.split(",")

['a', 'b', '  guido']

In [307]:
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [308]:
first, second, third = pieces
first + "::" + second + "::" + third

'a::b::guido'

In [309]:
"::".join(pieces)

'a::b::guido'

In [310]:
"guido" in val

True

In [311]:
val.index(",")

1

In [312]:
val.find(":")

-1

In [313]:
val.index(":")

ValueError: substring not found

In [314]:
val.count(",")

2

In [317]:
val.replace(",", "::")

'a::b::  guido'

In [318]:
val.replace(",", "")

'ab  guido'

In [319]:
txt = "Hello, And Welcome To My World!"
txt.casefold()

'hello, and welcome to my world!'

In [321]:
my_string_1 = "THIS SHOULD ALL BE IN LOWERCASE!  123"
my_string_1.casefold()

'this should all be in lowercase!  123'

In [322]:
txt = "banana"
txt.ljust(20)

'banana              '

In [323]:
txt.rjust(20)

'              banana'

In [324]:
txt.ljust(20, "O")

'bananaOOOOOOOOOOOOOO'

In [325]:
import re
text = "foo    bar\t baz  \tqux"
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [326]:
regex = re.compile(r"\s+")
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [327]:
regex.findall(text)

['    ', '\t ', '  \t']

In [328]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [329]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [330]:
m = regex.search(text)
m

In [336]:
m.start(), m.end()

(5, 20)

In [331]:
text[m.start():m.end()]

'dave@google.com'

In [335]:
print(regex.match(text))

None

In [337]:
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [338]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
regex = re.compile(pattern, flags=re.IGNORECASE)

In [341]:
m = regex.match("wesm@bright.net")
m

In [342]:
m.groups()

('wesm', 'bright', 'net')

In [343]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [346]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [11]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com", "Wes": np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [12]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [13]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [14]:
data_as_string_ext = data.astype('string')
data_as_string_ext

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [15]:
data_as_string_ext.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [17]:
import re
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [23]:
data.str.findall(pattern, flags=re.IGNORECASE).iloc[0]

[('dave', 'google', 'com')]

In [30]:
data.str.findall(pattern, flags=re.IGNORECASE).index

Index(['Dave', 'Steve', 'Rob', 'Wes'], dtype='object')

In [31]:
data.str.findall(pattern, flags=re.IGNORECASE).values

array([list([('dave', 'google', 'com')]),
       list([('steve', 'gmail', 'com')]), list([('rob', 'gmail', 'com')]),
       nan], dtype=object)

In [34]:
data.str.findall(pattern, flags=re.IGNORECASE).values[0]

[('dave', 'google', 'com')]

In [ ]:
data.str.findall(pattern, flags=re.IGNORECASE).values[0][0]

In [35]:
data.str.findall(pattern, flags=re.IGNORECASE).values[:]

array([list([('dave', 'google', 'com')]),
       list([('steve', 'gmail', 'com')]), list([('rob', 'gmail', 'com')]),
       nan], dtype=object)

In [44]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [45]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [46]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [47]:
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [48]:
values = pd.Series(['apple', 'orange', 'apple',
                    'apple'] * 2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [49]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [50]:
pd.value_counts(values)

C:\Users\Sam\AppData\Local\Temp\ipykernel_20452\3297668723.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

In [56]:
values.value_counts()

apple     6
orange    2
Name: count, dtype: int64

In [57]:
values = pd.Series([0, 1, 0, 0] * 2)
dim = pd.Series(['apple', 'orange'])
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [58]:
dim

0     apple
1    orange
dtype: object

In [59]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [60]:
fruits = ['apple', 'orange', 'apple', 'apple'] * 2
N = len(fruits)
rng = np.random.default_rng(seed=12345)
df = pd.DataFrame({'fruit': fruits,
                   'basket_id': np.arange(N),
                   'count': rng.integers(3, 15, size=N),
                   'weight': rng.uniform(0, 4, size=N)},
                  columns=['basket_id', 'fruit', 'count', 'weight'])
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [61]:
fruit_cat = df['fruit'].astype('category')
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [62]:
c = fruit_cat.array
type(c)

pandas.core.arrays.categorical.Categorical

In [63]:
c

['apple', 'orange', 'apple', 'apple', 'apple', 'orange', 'apple', 'apple']
Categories (2, object): ['apple', 'orange']

In [64]:
c.categories

Index(['apple', 'orange'], dtype='object')

In [65]:
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [69]:
list(enumerate(c.categories))

[(0, 'apple'), (1, 'orange')]

In [70]:
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [71]:
df['fruit'] = df['fruit'].astype('category')
df["fruit"]

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [75]:
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [74]:
df.dtypes

basket_id       int64
fruit        category
count           int64
weight        float64
dtype: object

In [76]:
my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [77]:
categories = ['foo', 'bar', 'baz']
codes = [0, 1, 2, 0, 0, 1]
my_cats_2 = pd.Categorical.from_codes(codes, categories)
my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [78]:
ordered_cat = pd.Categorical.from_codes(codes, categories,
                                        ordered=True)
ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [79]:
my_cats_2.as_ordered()

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [80]:
rng = np.random.default_rng(seed=12345)
draws = rng.standard_normal(1000)
draws[:5]

array([-1.4238,  1.2637, -0.8707, -0.2592, -0.0753])

In [81]:
bins = pd.qcut(draws, 4)
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [83]:
bins.value_counts()

(-3.121, -0.675]    250
(-0.675, 0.0134]    250
(0.0134, 0.687]     250
(0.687, 3.211]      250
Name: count, dtype: int64

In [86]:
bins = pd.qcut(draws, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])
bins

['Q1', 'Q4', 'Q1', 'Q2', 'Q2', ..., 'Q3', 'Q3', 'Q2', 'Q3', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [88]:
bins.codes[:10]

array([0, 3, 0, 1, 1, 0, 0, 2, 2, 0], dtype=int8)

In [96]:
bins = pd.Series(bins, name='quartile')
results = (pd.Series(draws)
           .groupby(bins, observed=False)
           .agg(['count', 'min', 'max'])
           .reset_index())
results

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

In [97]:
results['quartile']

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [100]:
N / 4

2500000.0

In [101]:
N // 4

2500000

In [98]:
N = 10_000_000
labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))

In [103]:
categories = labels.astype('category')
categories

0          foo
1          bar
2          baz
3          qux
4          foo
          ...
9999995    qux
9999996    foo
9999997    bar
9999998    baz
9999999    qux
Length: 10000000, dtype: category
Categories (4, object): ['bar', 'baz', 'foo', 'qux']

In [105]:
labels.memory_usage(deep=True)

520000132

In [106]:
categories.memory_usage(deep=True)

10000512

In [107]:
%time _ = labels.astype('category')

CPU times: total: 375 ms
Wall time: 385 ms

In [110]:
%timeit labels.value_counts()

203 ms  1.86 ms per loop (mean  std. dev. of 7 runs, 1 loop each)

In [111]:
%timeit categories.value_counts()

27.9 ms  532 s per loop (mean  std. dev. of 7 runs, 10 loops each)

In [112]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [117]:
cat_s.cat

In [114]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [115]:
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [118]:
actual_categories = ['a', 'b', 'c', 'd', 'e']
cat_s2 = cat_s.cat.set_categories(actual_categories)
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [120]:
cat_s.value_counts()

a    2
b    2
c    2
d    2
Name: count, dtype: int64

In [121]:
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
Name: count, dtype: int64

In [123]:
cat_s3 = cat_s[cat_s.isin(['a', 'b'])]
cat_s3

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [124]:
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

In [128]:
cat_s = pd.Series(['a', 'b', 'c', 'd'] * 2, dtype='category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [129]:
pd.get_dummies(cat_s, dtype=float)

     a    b    c    d
0  1.0  0.0  0.0  0.0
1  0.0  1.0  0.0  0.0
2  0.0  0.0  1.0  0.0
3  0.0  0.0  0.0  1.0
4  1.0  0.0  0.0  0.0
5  0.0  1.0  0.0  0.0
6  0.0  0.0  1.0  0.0
7  0.0  0.0  0.0  1.0

In [130]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS